articles/energydrink.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>energydrink</title>
<!-- 2020-09-21 Mon 17:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="ambi" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="./css/default.css" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content">
<h1 class="title">energydrink</h1>
<div id="table-of-contents">
<h1>Table of Contents</h1>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Energy Drink Tier List</a>
<ul>
<li><a href="#sec-1-1">Some up-front disclaimers</a>
<ul>
<li><a href="#sec-1-1-1">Energy Drinks are Expensive!</a></li>
<li><a href="#sec-1-1-2">Energy Drinks are Not Good Preworkouts</a></li>
<li><a href="#sec-1-1-3">Energy Drinks are Bad For You</a></li>
<li><a href="#sec-1-1-4">Just Drink Water!</a></li>
</ul>
</li>
<li><a href="#sec-1-2">Tier List</a>
<ul>
<li><a href="#sec-1-2-1">S</a></li>
<li><a href="#sec-1-2-2">A</a></li>
<li><a href="#sec-1-2-3">A-</a></li>
<li><a href="#sec-1-2-4">B+</a></li>
<li><a href="#sec-1-2-5">B</a></li>
<li><a href="#sec-1-2-6">B-</a></li>
<li><a href="#sec-1-2-7">C+</a></li>
<li><a href="#sec-1-2-8">C</a></li>
<li><a href="#sec-1-2-9">C-</a></li>
<li><a href="#sec-1-2-10">D</a></li>
<li><a href="#sec-1-2-11">D-</a></li>
<li><a href="#sec-1-2-12">F</a></li>
</ul>
</li>
<li><a href="#sec-1-3">Overarching Thoughts on the Institution of Energy Drinks</a>
<ul>
<li><a href="#sec-1-3-1">Caffeine Content</a></li>
<li><a href="#sec-1-3-2">Sugar Content / Calories</a></li>
<li><a href="#sec-1-3-3">I Wish There Were More Samplers</a></li>
</ul>
</li>
<li><a href="#sec-1-4">Remaining To-Do items</a></li>
<li><a href="#sec-1-5">Updates</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-1">
<h1 id="sec-1">Energy Drink Tier List</h1>
<div class="outline-text-1" id="text-1">
<p>
<i>Last Updated 3-18-20</i>
</p>

<p>
Over the last several months I have been drinking a lot of energy drinks as a slightly more fun way of consuming caffeine before workouts / focus sessions, and I thought I would assemble a list of my thoughts on each one.
</p>

<p>
Given that my ability to obtain random single flavors has been significantly hampered by the global pandemic happening right now, I've decided I'm just going to upload what I have right now and then add to it slowly as I accrue more and more flavors. So far I've tried about 30, so expect this list to grow as I go on this journey. 
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-2">
<h2 id="sec-1-1">Some up-front disclaimers</h2>
<div class="outline-text-2" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-3">
<h3 id="sec-1-1-1">Energy Drinks are Expensive!</h3>
<div class="outline-text-3" id="text-1-1-1">
<p>
Energy drinks are not an efficient means of doing anything. If you want caffeine in the cheapest way possible, purchase caffeine tablets off of amazon. They are like $0.04 per 100mg serving, meaning you can just take one or two with some tap water and immediately have 90%+ of the same effect of monster or whatever. If you want preworkout, add on some <a href="https://examine.com/supplements/beta-alanine/">beta alanine</a> and <a href="https://examine.com/supplements/citrulline/">citrulline</a>, which provide some muscular endurance and fatigue/soreness reduction, respectively. If you want to shell out the money for a fun can of almost soda which has some useful things in it, feel free to drink energy drinks. 
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-3">
<h3 id="sec-1-1-2">Energy Drinks are Not Good Preworkouts</h3>
<div class="outline-text-3" id="text-1-1-2">
<p>
This is correct, usually they're not as good as actual preworkouts for use as preworkouts. But caffeine really gets you 90% of the way there, and it's more fun to try 30 flavors of energy drink over the course of a few weeks rather than try 30 different tubs of preworkout over the course of probably years. If your energy drink doesn't have citrulline or whatever, just take some with it.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-3">
<h3 id="sec-1-1-3">Energy Drinks are Bad For You</h3>
<div class="outline-text-3" id="text-1-1-3">
<p>
Of course they are bad for you. That said, the badness of energy drinks is, I find, <a href="https://examine.com/nutrition/are-energy-drinks-bad-for-you/">vastly</a> <a href="https://examine.com/nutrition/the-mild-health-risks-of-energy-drinks/">overstated</a> especially when explicitly paired with stuff like resistance training, for which their active ingredients frequently help out with <a href="https://link.springer.com/article/10.1007/s00421-007-0557-x">strength</a> and <a href="https://pdfs.semanticscholar.org/12b4/7c27f774c7968b80d8309a3300a9a9901f09.pdf">anaerobic capability</a>. You obviously don't want to go nuts with these things but as long as you stay under the FDA's safe zone of 400mg per day from all sources it's really not going to be the worst thing in the world (probably).
</p>
</div>
</div>

<div id="outline-container-sec-1-1-4" class="outline-3">
<h3 id="sec-1-1-4">Just Drink Water!</h3>
<div class="outline-text-3" id="text-1-1-4">
<p>
Water doesn't have caffeine in it. Mixing caffeine with water tastes awful. I drink plenty of water, and generally speaking don't drink more than one energy drink on any given day. Please, I beg you, go away.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-2">
<h2 id="sec-1-2">Tier List</h2>
<div class="outline-text-2" id="text-1-2">
<p>
TODO: Add more notes about the flavors of each of these.
</p>

<p>
Some keys:
</p>

<p>
\(^c\) - has a flavor a lot like candy; potentially overly sweet, which is a turnoff to some people
</p>

<p>
\(^m\) - contains milk, which I have a hard time drinking and usually docks points for me off of otherwise good drinks
</p>

<p>
\(^\uparrow\) - Has a lot of caffeine, usually labeled 
</p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-3">
<h3 id="sec-1-2-1">S</h3>
<div class="outline-text-3" id="text-1-2-1">
<ul class="org-ul">
<li><b>Monster Zero Ultra (white)</b> Perhaps sort of a meme to have this in S tier but my relatively informed opinion on this is that it is still quite good
</li>
<li><b>Monster Ultra Sunrise (Orange)</b> Pretty much orange soda
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-3">
<h3 id="sec-1-2-2">A</h3>
<div class="outline-text-3" id="text-1-2-2">
<ul class="org-ul">
<li><b>Monster Ultra Blue</b> Possible S tier, need to try again
</li>
<li><b>Reign Sour Apple</b> \(^{c \uparrow 300mg}\) You will probably like it if you think "caffeinated green jolly rancher" sounds appealing to you
</li>
<li><b>Reign Blue Razz</b> \(^{\uparrow 300mg}\)
</li>
<li><b>Monster Ultra Red</b> \(^c\)
</li>
<li><b>3D Strawberry (Chrome)</b> \(^{\uparrow 200mg}\)
</li>
<li><b>Reign Mango</b> \(^{\uparrow 300mg}\) Would probably like this more if I liked mango in general more, but it is a good flavor
</li>
<li><b>Monster Ultra Paradise (Green)</b> \(^c\) see reign sour apple, but more sickly sweet
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-3">
<h3 id="sec-1-2-3">A-</h3>
<div class="outline-text-3" id="text-1-2-3">
<ul class="org-ul">
<li><b>Reign Orange Dreamsicle</b> \(^{c \uparrow 300mg}\) orange cream flavor definitely very well captured imo
</li>
<li><b>Reign Strawberry Sublime</b> \(^{c \uparrow 300mg}\)
</li>
<li><b>Red Bull Crisp Pear</b>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-4" class="outline-3">
<h3 id="sec-1-2-4">B+</h3>
<div class="outline-text-3" id="text-1-2-4">
<ul class="org-ul">
<li><b>Reign Melon Mania</b> \(^{\uparrow 300mg}\)
</li>
<li><b>Adrenaline Shoc Frozen Ice</b> \(^{c \uparrow 300mg}\)
</li>
<li><b>Monster Ultra Fiesta</b>
</li>
<li><b>Monster Ultra Rose</b>
</li>
<li><b>Bang Sour Heads</b> \(^{c \uparrow 300mg}\)
</li>
<li><b>Bang Blue Razz</b> \(^{\uparrow 300mg}\)
</li>
<li><b>Sugar Free Red Bull</b> Low caffeine content + high price hurts this, but it tastes good
</li>
<li><b>Red Bull Zero</b> Tastes pretty much exactly the same as sugar free red bull
</li>
<li><b>Adrenaline Shoc Watermelon</b> \(^{c \uparrow 300mg}\)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-5" class="outline-3">
<h3 id="sec-1-2-5">B</h3>
<div class="outline-text-3" id="text-1-2-5">
<p>
B tier and below is where I start deciding I mostly would rather not be drinking these
</p>

<ul class="org-ul">
<li><b>Adrenaline Shoc Fruit Punch</b> \(^{\uparrow 300mg}\) Tastes like overly sweet fruit punch
</li>
<li><b>Adrenaline Shoc Mango Peach</b> \(^{\uparrow 300mg}\)
</li>
<li><b>Monster Energy Iced Tea</b> \(^c\)
</li>
<li><b>Monster Rehab Lemonade + Tea</b>
</li>
<li><b>Monster Java Mean Bean</b> Just shy of 200mg caffeine, tastes pretty good if you like coffee with milk but an unfortunate one if you are lactose intolerant.
</li>
<li><b>Bang Berry Bangster</b> \(^{c \uparrow 300mg}\)
</li>
<li><b>Red Bull (Regular)</b>
</li>
<li><b>Uptime, Sugarfree</b> notably has L-Theanine in it
</li>
<li><b>Reign Inferno Red Dragon</b> \(^{\uparrow 300mg}\)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-6" class="outline-3">
<h3 id="sec-1-2-6">B-</h3>
<div class="outline-text-3" id="text-1-2-6">
<ul class="org-ul">
<li><b>Adrenaline Shoc Sour Candy</b> \(^{\uparrow 300mg}\) it's very, very sour
</li>
<li><b>Adrenaline Shoc Acai Berry</b> \(^{\uparrow 300mg}\)
</li>
<li><b>Monster Rehab Orangeade</b>
</li>
<li><b>Uptime, Original Citrus</b> think "capri sun for adults", also has L-theanine in it
</li>
<li><b>Monster Rehab Raspberry Tea</b>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-7" class="outline-3">
<h3 id="sec-1-2-7">C+</h3>
<div class="outline-text-3" id="text-1-2-7">
<ul class="org-ul">
<li><b>Reign Inferno True Blu</b> \(^{\uparrow 300mg}\)
</li>
<li><b>Arenaline Shoc Cotton Candy</b> \(^{\uparrow 300mg}\)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-8" class="outline-3">
<h3 id="sec-1-2-8">C</h3>
<div class="outline-text-3" id="text-1-2-8">
<ul class="org-ul">
<li><b>Bang Star Blast</b> \(^{c \uparrow 300mg}\)
</li>
<li><b>Low Carb Blue Monster</b>
</li>
<li><b>Bang Rainbow Unicorn</b> \(^{c \uparrow 300mg}\)
</li>
<li><b>Reign Lemon</b> \(^{\uparrow 300mg}\) as my SO put it: "it tastes like danger"
</li>
<li><b>Rockstar Peach Iced Tea</b> \(^{\uparrow 300mg}\)
</li>
<li><b>Bang Cotton Candy</b> \(^{\uparrow 300mg}\)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-9" class="outline-3">
<h3 id="sec-1-2-9">C-</h3>
<div class="outline-text-3" id="text-1-2-9">
<ul class="org-ul">
<li><b>Standard Monster</b>
</li>
<li><b>Monster Zero Sugar</b> minimal difference from normal flavor
</li>
<li><b>Monster Absolute Zero</b> I'm not even sure this is a different flavor from zero sugar or if the cans just come in pairs
</li>
<li><b>Hi-Ball Blood Orange</b>
</li>
<li><b>Bang Frose Rose</b> \(^{\uparrow 300mg}\)
</li>
<li><b>Adrenaline Shoc, Black</b> \(^{c \uparrow 300mg}\)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-10" class="outline-3">
<h3 id="sec-1-2-10">D</h3>
<div class="outline-text-3" id="text-1-2-10">
<p>
Everything below D tier I would call "atrocious"
</p>

<ul class="org-ul">
<li><b>Rockstar, in general</b>
</li>
<li><b>Monster Ultra Violet</b> 
</li>
<li><b>Coke Energy</b> 
</li>
<li><b>Cherry Coke Energy</b>
</li>
<li><b>Reign Cotton Candy</b> \(^{\uparrow 300mg}\)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-11" class="outline-3">
<h3 id="sec-1-2-11">D-</h3>
<div class="outline-text-3" id="text-1-2-11">
<ul class="org-ul">
<li><b>Bang Miami Cola</b> \(^{\uparrow 300mg}\) imagine the unpleasantness of giving budget cola at a restaurant instead of coke, which you asked for, but multiply that unpleasantness by ten thousand times.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-12" class="outline-3">
<h3 id="sec-1-2-12">F</h3>
<div class="outline-text-3" id="text-1-2-12">
<ul class="org-ul">
<li><b>Reign Thermogenic Jalapeno Strawberry</b> \(^{\uparrow 300mg}\) I am baffled they sell this, and am convinced it is a novelty flavor. I was talked into buying this explicitly so I could put it in this list, and even so I regret having to drink this.
</li>
<li><b>Bang Birthday Cake Bash</b> \(^{c \uparrow 300mg}\) tastes like cake made with expired milk
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-1-3" class="outline-2">
<h2 id="sec-1-3">Overarching Thoughts on the Institution of Energy Drinks</h2>
<div class="outline-text-2" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-3">
<h3 id="sec-1-3-1">Caffeine Content</h3>
<div class="outline-text-3" id="text-1-3-1">
<p>
I really can't stress how mind-bending it is to me that so many of these drinks contain 300 milligrams of caffeine in them. For scale, that's something like 3-5 cups of coffee, all at once in one beverage. A number of the below drinks contain that amount and I certainly cannot recommend them unless you are explicitly going to exert yourself in some way immediately after (e.g. lifting weights). 
</p>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-3">
<h3 id="sec-1-3-2">Sugar Content / Calories</h3>
<div class="outline-text-3" id="text-1-3-2">
<p>
I have a very strong preference against drinks with sugar / caloric content in general. You might think this is because I think they add empty calories in exchange for no actual nutritional benefits. You would be half right, but I also think generally speaking non-diet soda just tastes pretty terrible (see: diet coke vs regular coke). As such please keep in mind that I have this relatively extreme bias, and that most of the sugary energy drinks are ranked fairly low as a consequence.
</p>
</div>
</div>

<div id="outline-container-sec-1-3-3" class="outline-3">
<h3 id="sec-1-3-3">I Wish There Were More Samplers</h3>
<div class="outline-text-3" id="text-1-3-3">
<p>
Generally speaking, I don't know how you could arrive at opinions about this sort of thing unless you get to try tons and tons of flavors. I know wine people have wine tasting parties where you drink a sip or two of many different kinds of wines, and I am a bit frustrated that I'm doing the caffeine equivalent of buying many bottles of wine, even if I end up hating the bottle. Likewise preworkout doesn't usually come in single serving packets (and even if they did, they would be all the same flavor), so I wish there was a generally more efficient way of doing this compared to just purchasing tons of things and then finishing them.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-1-4" class="outline-2">
<h2 id="sec-1-4">Remaining To-Do items</h2>
<div class="outline-text-2" id="text-1-4">
<ul class="org-ul">
<li>Some interesting visualizations would be fun probably
<ul class="org-ul">
<li>Caffeine content vs score
</li>
<li>Subjective candy-ness vs score
</li>
</ul>
</li>
<li>Drink more energy drinks
<ul class="org-ul">
<li>3D Energy Drinks (enjoyed the one flavor I've tried)
</li>
<li>Misc stragglers of the brands I've tried
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-5" class="outline-2">
<h2 id="sec-1-5">Updates</h2>
<div class="outline-text-2" id="text-1-5">
<ul class="org-ul">
<li>4/12/20: added six drinks, moved a few things around based on new criteria
</li>
<li>4/26/20: added 10ish drinks
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
<div id="comments">
    <p></p>
    <hr />
       <div id="disqus_thread">
           <script>
(function() {
var d = document, s = d.createElement('script');
s.src = 'https://planetbanatt.disqus.com/embed.js';
s.setAttribute('data-timestamp', +new Date());
(d.head || d.body).appendChild(s);
})();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</div>
</body>
</html>
